specters312/SVD_DUMP/Atmel/ATSAM4LC8B.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HMATRIX</name>
      <version>1.3.0</version>
      <description>HSB Matrix</description>
      <groupName>HMATRIXB</groupName>
      <prependToName>HMATRIX_</prependToName>
      <baseAddress>0x400A1000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MCFG%s</name>
          <description>Master Configuration Register</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>ULBT</name>
              <description>Undefined Length Burst Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>ULBTSelect</name>
                <enumeratedValue>
                  <name>INFINITE</name>
                  <description>Infinite Length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single Access</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR_BEAT</name>
                  <description>Four Beat Burst</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT_BEAT</name>
                  <description>Eight Beat Burst</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN_BEAT</name>
                  <description>Sixteen Beat Burst</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MRCR</name>
          <description>Master Remap Control Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>RCB0</name>
              <description>Remap Command bit for Master 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB0Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB1</name>
              <description>Remap Command bit for Master 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB1Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB2</name>
              <description>Remap Command bit for Master 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB2Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB3</name>
              <description>Remap Command bit for Master 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB3Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB4</name>
              <description>Remap Command bit for Master 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB4Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB5</name>
              <description>Remap Command bit for Master 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB5Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB6</name>
              <description>Remap Command bit for Master 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB6Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB7</name>
              <description>Remap Command bit for Master 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB7Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB8</name>
              <description>Remap Command bit for Master 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB8Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB9</name>
              <description>Remap Command bit for Master 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB9Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB10</name>
              <description>Remap Command bit for Master 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB10Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB11</name>
              <description>Remap Command bit for Master 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB11Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB12</name>
              <description>Remap Command bit for Master 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB12Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB13</name>
              <description>Remap Command bit for Master 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB13Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB14</name>
              <description>Remap Command bit for Master 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB14Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RCB15</name>
              <description>Remap Command bit for Master 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RCB15Select</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable remapped address decoding for master</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Enable remapped address decoding for master</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>PRAS%s</name>
          <description>Priority Register A for Slave</description>
          <addressOffset>0x080</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M0PR</name>
              <description>Master 0 Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M1PR</name>
              <description>Master 1 Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M2PR</name>
              <description>Master 2 Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M3PR</name>
              <description>Master 3 Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M4PR</name>
              <description>Master 4 Priority</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M5PR</name>
              <description>Master 5 Priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M6PR</name>
              <description>Master 6 Priority</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M7PR</name>
              <description>Master 7 Priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>PRBS%s</name>
          <description>Priority Register B for Slave</description>
          <addressOffset>0x084</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>M8PR</name>
              <description>Master 8 Priority</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M9PR</name>
              <description>Master 9 Priority</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M10PR</name>
              <description>Master 10 Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M11PR</name>
              <description>Master 11 Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M12PR</name>
              <description>Master 12 Priority</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M13PR</name>
              <description>Master 13 Priority</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M14PR</name>
              <description>Master 14 Priority</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>M15PR</name>
              <description>Master 15 Priority</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SCFG%s</name>
          <description>Slave Configuration Register</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>SLOT_CYCLE</name>
              <description>Maximum Number of Allowed Cycles for a Burst</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>DEFMSTR_TYPE</name>
              <description>Default Master Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DEFMSTR_TYPESelect</name>
                <enumeratedValue>
                  <name>NO_DEFAULT</name>
                  <description>No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST_DEFAULT</name>
                  <description>Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_DEFAULT</name>
                  <description>Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIXED_DEFMSTR</name>
              <description>Fixed Index of Default Master</description>
              <bitOffset>18</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>ARBT</name>
              <description>Arbitration Type</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ARBTSelect</name>
                <enumeratedValue>
                  <name>ROUND_ROBIN</name>
                  <description>Round-Robin Arbitration</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIXED_PRIORITY</name>
                  <description>Fixed Priority Arbitration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>SFR%s</name>
          <description>Special Function Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SFR</name>
              <description>Special Function Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
